Tekla Open API Reference for Tekla Structures 2025
DrawingCoordinateConverter.Convert Method (ViewBase, ViewBase, PointList)
 Converts a list of coordinate points from one view's coordinate system to another view's coordinate system.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PointList Convert(
	ViewBase fromView,
	ViewBase toView,
	PointList pointList
)
Public Shared Function Convert (
	fromView As ViewBase,
	toView As ViewBase,
	pointList As PointList
) As PointList
Parameters
fromView
Type: Tekla.Structures.Drawing.ViewBase
The source view.
toView
Type: Tekla.Structures.Drawing.ViewBase
The target view.
pointList
Type: Tekla.Structures.Drawing.PointList
The list of points to be converted.
Return Value
Type: PointList
The converted list of points.
See Also
Reference
DrawingCoordinateConverter Class
Convert Overload
Tekla.Structures.Drawing.Tools Namespace